function skinTypeClearRadios(idOfBotton){
	
	var inputElementArray = idOfBotton.parentNode.parentNode.getElementsByTagName('input');

		for (var i = 0; i < inputElementArray.length; i++) {
					var inputElement = inputElementArray[i];

					inputElement.checked = false;
		}
}
function skinTypeShowResult(){
/////////////////////////////baraye chek kardan pasokh be tamame soalat
	var qNumbers=2;
	var hasNotBeenAnswered=qNumbers;
	for(i=1;i<=qNumbers;i++){
		radioLen=document.getElementsByName("q"+i).length;
		for(j=1;j<=radioLen;j++){
			if (document.getElementById("q"+i+j).checked== true ){
				hasNotBeenAnswered--;
				break;
			}
		}		
	}
////////if baraye hasNotBeenAnswered
	if(hasNotBeenAnswered!=0){
		document.getElementById('warning').style.display="block";
		document.getElementById('warning').innerHTML="*لطفا به تمامی سوالات پاسخ دهید.";
		}
///////////////////////////////////
	else{
		var skinType=0;
		var skinCare=0;
		//document.getElementById('test').style.border="none";

		radioLen=document.getElementsByName("q1").length;
		for(i=1;i<=radioLen;i++){
			if (document.getElementById("q1"+i).checked== true){
				skinType = document.getElementById("q1"+i).value;
				break;
			}
		}
		for(i=1;i<=radioLen;i++){
			if (document.getElementById("q2"+i).checked== true){
				skinCare = document.getElementById("q2"+i).value;
				break;
			}
		}

	///////////////////////////////////////////////
		document.getElementById('question-set').style.display="none";
		document.getElementById('result').style.display="block";
		location.href = "#";
		location.href = "#test";
		//window.scrollTo(0,0);
		var skinSensitiveResult;
		var skinTypeResult;
		var rTitle;
		var rContent;
		var rCareTitle="بهترین ترکیب برای نوع پوستی شما"
		var pName1;
		var pName2;
		var pImage1="https://naringol.com/media/wysiwyg/joininstagram.jpg";
		var pLink1;
		var pImage2="https://naringol.com/media/wysiwyg/joininstagram.jpg";
		var pLink2;
		var pContent;
		
		if(skinType==1 && skinCare==1){
			rTitle="نوع پوست چرب مشکل پوستی جوش ";
			rContent="پوست شما چربی بیش از اندازه ای تولید می کند و سیبوم پوست شما اسید لینولئیک پایینی دارد به همین دلیل چسبنده شده منافذ را می بندد  و شما دچار جوش های سر سیاه و سر سفید و زیر پوست می شوید. علاوه بر داشتن روتین روزانه ای که شامل فوم یا ژل شست وشو دهنده و کرم آبرسان می شود اضافه نمودن روغن هایی که دارای میزان بالایی از اسید لینولئیک هستند و هم چنین دارای خاصیت ضد بامتری و پاکسازی کننده قوی هستند می تواند به تعادل رساندن چربی پوست شما و درمان انواع جوش ها کمک کند.";
			pName1="روغن هسته انگور ";
			pName2="روغن درخت چای";
			pImage1="https://naringol.com/media/catalog/product/cache/5/small_image/250x250/9df78eab33525d08d6e5fb8d27136e95/5/0/500.500_12.jpg";
			pImage2="https://naringol.com/media/catalog/product/cache/5/small_image/250x250/9df78eab33525d08d6e5fb8d27136e95/b/e/bergamot_3_11_edited_2.jpg";
			pLink1="https://naringol.com/pure-and-organic-grape-seed-oil.html";
			pLink2="https://naringol.com/tea-tree-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن هسته انگور و ده قطره روغن درخت چای را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
		if(skinType==1 && skinCare==2 ){
			rTitle=" نوع پوست چرب مشکل لک و جای جوش ";
			rContent="پپوست شما چربی زیادی تولید می کند و همزمان دارای لک و جای جوش هایی که به شکل قهوه ای و قرمزی هستند می باشد. برای بهبود لک ها و جای جوش باید از روغن هایی استفاده نمایید که مخصوص پوست چرب بوده و اصلا حس سنگینی را روی پوست شما ایجاد نکرده و باعث جوش زدن شما نشوند. خوشبختانه نارین گل می تواند بهترین روغن های ضد لک مناسب پوست چرب را در اختیار شما قرار دهد.";
			pName1="روغن دانه پاپایا ";
			pName2="روغن لیمو ";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/pure-and-organic-papaya-seed-oil.html";
			pLink2="https://naringol.com/pure-and-organic-lemon-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن دانه پاپایا و ده قطره روغن لیمو را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
		if(skinType==1 && skinCare==3 ){
			rTitle="نوع پوست چرب مشکل چروک ها و سفت شدن پوست";
			rContent="چروک های پوست حتی برای پوست های چرب نیز اتفاق می افتد. با بالا رفتن سن تولید کلاژن در پوست کاهش یافته و پوست شل و دارای چروک می شود. بنابراین حتی پوست های چرب نیز برای پیشگیری از چروک و پیری پوست به آبرسانی عمیق و روغن هایی نیاز دارند که در عین سبک بودن سرشار از اسیدهای چرب مفید و آنتی اکسیدان هایی باشد که از چروک های آینده جلوگیری کرده و چروک های موجود را بهبود بخشیده و از شل شدن پوست جلوگیری نماید.";
			pName1="روغن هسته انار  ";
			pName2="روغن دانه هویج ";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/organic-and-pomegranate-seed-oil.html";
			pLink2="https://naringol.com/pure-and-organic-carrot-seed-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن هسته انار و ده قطره روغن دانه هویج را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
		if(skinType==1 && skinCare==4 ){
			rTitle="نوع پوست چرب مشکل کم آبی پوست";
			rContent="پوست های چرب نیز می توانند کم آب و دهیدراته شوند. چربی و رطوبت پوست دو مقوله جدا هستند. کم آبی پوست در اثر استفاده بیش از حد از شوینده های قوی، ماسک های خشک کننده و محصولات ضد جوش خشک کننده برای پوست های چرب ممکن ایجاد شود. برای درمان کم آبی پوست های چرب باید از روغن هایی استفاده شود که در عین سبک بودن با داشتن میزان بالایی از اسید لینولئیک و آمینو اسیدها رطوبت و شادابی را به پوست شما بازگردانند.";
			pName1="روغن هسته هندوانه   ";
			pName2="روغن ترنج  ";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/pure-and-organic-watermelon-seed-oil.html";
			pLink2="https://naringol.com/organic-pure-bergamot-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن هسته هندوانه و ده قطره روغن ترنج را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
		if(skinType==2 && skinCare==1 ){
			rTitle="نوع پوست مختلط مشکل جوش های پوستی";
			rContent="پوست شما در عین حال که در نواحی بینی، گونه ها، چانه و پیشانی چرب است و چربی بیش از اندازه در این نواحی تولید می شود در نواحی دیگری خشک و کم آب است. برای درمان جوش های پوست های مختلط علاوه بر داشتم روتین پوستی روزانه که شامل فوم یا ژل شست و شوی صورت و کرم آبرسان مخصوص پوست مختلط است می توانید هر شب در آخرین محله روتین از روغن هایی استفاده نمایید که درعین سبک بودن ملایم نیز باشند و در عین پاکسازی پوست از چربی و آلودگی و درمان جوش های شما رطوبت پوستتان را از بین نبرده و پوستتان را به تعادل برسانند.";
			pName1="روغن پامچال";
			pName2="روغن سروکوهی";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/evening-primrose-oil.html";
			pLink2="https://naringol.com/juniper-berries-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن پامچال و ده قطره روغن سروکوهی را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
		if(skinType==2 && skinCare==2 ){
			rTitle="نوع پوست مختلط مشکل لک های پوستی";
			rContent="پوست شما در عین حال که در نواحی بینی، گونه ها، چانه و پیشانی چرب است و چربی بیش از اندازه در این نواحی تولید می شود در نواحی دیگری خشک و کم آب است. برای درمان لک ها و جای جوش هایی که به صورت قهوه ای و قرمزی است پوست های مختلط باید از ترکیبی استفاده نمایند که در عین ملایم و آبرسان بودن بتواند لک ها را بهبود دهد.";
			pName1="روغن سنجد تلخ";
			pName2="روغن لیمو";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/--12217";
			pLink2="https://naringol.com/pure-and-organic-lemon-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن سنجد تلخ و ده قطره روغن لیمو را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
		if(skinType==2 && skinCare==3 ){
			rTitle=" نوع پوست مختلط مشکل چروک و افتادگی پوست";
			rContent="پوست شما درعین حال که در نواحی بینی، گونه ها، چانه و پیشانی چرب است و چربی بیش از اندازه در این نواحی تولید می شود در نواحی دیگری خشک و کم آب است و به همین دلیل بیشتر در معرض چروک ها است. پوست های مختلط برای پیشگیری از چروک و شل شدت پوست باید از سنین پایین تر عمیقا پوست را با روغن هایی که میزان برابری از اسید لینلوئیک و اسید اولئیک و دارای انواع ویتامین هستند آبرسانی نمایند. ";
			pName1="روغن هسته انار";
			pName2="روغن کندر";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/organic-and-pomegranate-seed-oil.html";
			pLink2="https://naringol.com/pure-and-organic-frankincense-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن هسته انار و ده قطره روغن کندر را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
			if(skinType==2 && skinCare==4 ){
			rTitle=" نوع پوست مختلط مشکل خشکی و کم آب بودن پوست";
			rContent="پوست شما درعین حال که در نواحی بینی، گونه ها، چانه و پیشانی چرب است و چربی بیش از اندازه در این نواحی تولید می شود در نواحی دیگری خشک و کم آب است و ممکن است حتی در فصل های سرد سال پوستتان ملتهب، قرمز و پوسته پوسته شود. اصلا نگران نباشید نارین گل بهترین روغن ها برای آّرسانی و به تعادل رساندن پوست های مختلط و کم آب را برای شما فراهم آورده است.  ";
			pName1="روغن هسته هلو ";
			pName2="روغن مر ";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/peach-kernel-oil.html";
			pLink2="https://naringol.com/peach-kernel-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن هسته هلو و ده قطره روغن مر را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
		if(skinType==3 && skinCare==1 ){
			rTitle=" نوع پوست خشک مشکل جوش و منافذ بزرگ";
			rContent="پوست های خشک نیز که چربی کمی دارند ممکن است گاهی به دلایلی وقتی بدن یا پوست از حالت تعادل خارج می شود جوش بزنند در این مواقع علاوه بر داشتن روتین پوستی مخصوص پوست خشک که شامل فوم یا ژل شست و شو پوست خشک و کرم آبرسان پوست خشک می توانند در آخرین مرحله روتین از روغن هایی استفاده نمایند که علاوه بر ملایم بودن و آّرانی پوست بتواند پوست را پاکسازی و از جوش زدن جلوگیری نماید.";
			pName1="روغن پامچال";
			pName2="روغن مریم گلی";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/evening-primrose-oil.html";
			pLink2="https://naringol.com/pure-and-organic-sage-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن پامچال و ده قطره روغن مریم گلی را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
		if(skinType==3 && skinCare==2 ){
			rTitle="نوع پوست خشک مشکل لک و جای جوش های قهوه ای و قرمز";
			rContent="پوست شما به دلیل میزان کم چربی خشک است و برای به تعادل رسیدن نیاز به آبرسانی دارد. حال اگر پوستتان دارای لک نیز باشد باید از روغن هایی استفاده نمایید که علاوه بر آبرسانی پوست با داشتن اسیدهای چرب و ویتامین ها بهتواند به درمان لک ها کمک کند.";
			pName1="روغن میوه نسترن ";
			pName2="روغن بهارنارنج ";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/rosehip-oile.html";
			pLink2="https://naringol.com/neroli-essential-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن میوه نسترن و ده قطره روغن بهارنارنج را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
		if(skinType==3 && skinCare==3 ){
			rTitle="نوع پوست خشک مشکل چروک و افتادگی پوست  ";
			rContent="پوست های خشک اگرچه از جوش زدن در امن هستند اما بیشتر از هر نوع پوست دیگری مستعد چروک ها و پیری زودرس پوست هستند. برای جلوگیری از چروک شدن و شل پوست های خشک باید از روغن هایی استفاده کنید که علاوه بر داشتن میزان بالایی از اسید اولئیک جهت آبرسانی عمیق پوست دارای انواع ویتامین ها و آنتی اکسیدان ها و خاصیت تحریک تولید کلاژن جهت جلوگیری از پیری زودرس پوست و چروک های عمیق پوستی باشد. ";
			pName1="روغن هسته زردآلو  ";
			pName2="روغن شمعدانی ";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/pure-and-organic-apricot-kernel-oil.html";
			pLink2="https://naringol.com/pure-and-organic-geranium-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن هسته زردآلو و ده قطره روغن شمعدانی را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
		if(skinType==3 && skinCare==4 ){
			rTitle=" نوع پوست خشک مشکل خشکی و کم آبی پوست";
			rContent="در پوست های خشک چربی پوست به میزان کمی تولید می شود و به همین دلیل در اکثر مواقع پوست احساس کشیدگی، یکدست نبودن و حتی التهاب دارد. علاوه بر خشک بودن این نوع پوست می تواند دچار کم آبی نیز شود و رطوبت خود را نیز تا حد زیادی از دست دهد و کدر به نظر برسد. روغن هایی که دارای میزان بالایی از اسید اولئیک و ویتامین ها هستند می توانند پوست های خشک و کم آب را تا حد زیادی بهبود دهند.";
			pName1="کره انبه";
			pName2="روغن جوانه گندم";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/pure-and-organic-mango-butter.html";
			pLink2="https://naringol.com/pure-oil-and-organic-wheat-germ.html";
			pContent="مقداری آب را در قابلمه ای جوش بیاورید. یک قاشق غذاخوری کره انبه و دو قاشق غذاخوری روغن جوانه گندم را داخل یک ظرف شیشه ای ریخته و داخل قابلمه حاوی آب جوش بگذارید و بهم بزنید تا مایه یکدستی حاصل شده و کره انبه و روغن جوانه گندم با هم مخلوط شوند. سپس مخلوط را از روی گاز برداشته و بگزارید خنک شود. بعد از خنک شدن مخلوط را در یک ظرف کرم در دار ریخته و داخل یخچال نگهداری نمایید. هر شب در آخرین مرحله روتین مقداری از این ترکیب را بر پوست تمیز ماساژ دهید.";
		}
		if(skinType==4 && skinCare==1 ){
			rTitle="نوع پوست معمولی مشکل جوش و منافذ بزرگ";
			rContent="در پوست های معمولی میزان تولید چربی پوست به صورت متعادل است و این نوع پوست ها نه خشک هستند و نه چرب و معمولا مشکل پوستی خاصی ندارند اما هر از گاهی ممکن است که به دلایلی بدن یا پوست شما از تعادل خارج شود و جوش بزنید. در این مواقع برخی روغن ها می توانند کمک کنند تا جوش هایتان درمان شود.";
			pName1="روغن دانه خیار";
			pName2="روغن سروکوهی ";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/pure-and-organic-cucumber-seed-oil.html";
			pLink2="https://naringol.com/juniper-berries-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن دانه خیار و ده قطره روغن سروکوهی را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
		if(skinType==4 && skinCare==2 ){
			rTitle="نوع پوست معمولی مشکل لک و جای جوش قهوه ای و قرمز ";
			rContent="هر نوع پوستی به دلیل عوامل محیطی، بهم ریختگی های هورمونی و یا موارد دیگر ممکن است دچار لک شود. پوست های معمولی نیز از این قاعده مستثنی نیستند. برای درمان لک های پوست های معمولی باید از روغن هایی استفاده شود که در عین حفظ رطوبت پوست با داشتن انواع ویتامین و اسیدهای چرب به بهبود لک ها کمک کند.";
			pName1="روغن میوه نسترن ";
			pName2="روغن لیمو";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/rosehip-oile.html";
			pLink2="https://naringol.com/pure-and-organic-lemon-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن میوه نسترن و ده قطره روغن لیمو را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
		if(skinType==4 && skinCare==3 ){
			rTitle="نوع پوست معمولی مشکل چروک و افتادگی پوست ";
			rContent="پوست های معمولی به دلیل اینکه چربی زیادی ندارند بیشتر از پوست های چرب و مختلط در معرض چروک شدن و پیری زودرس هستند. اما نگران نباشید با استفاده از روغن هایی که دارای آنتی اکسیدان و انواع ویتامین هستندو پوست را عمیقا آبرسانی می کند می تواند به جوان نگه داشتن پوست شما کمک کند.";
			pName1="روغن هسته انار  ";
			pName2="روغن کندر ";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/organic-and-pomegranate-seed-oil.html";
			pLink2="https://naringol.com/pure-and-organic-frankincense-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن هسته انار و ده قطره روغن کندر را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
		if(skinType==4 && skinCare==4 ){
			rTitle="نوع پوست معمولی مشکل خشکی و کم آبی پوست ";
			rContent="کم آبی پوست در سال های اخیر به دلیل استفاده از مواد آرایشی، آلودگی هوا و عواکل محیطی دیگر بیشتر شده است. پوست های معمولی نیز می توانند کم آب شوند و برای برطرف کردن کم آبی و خشکی این نوع پوست ها می توان از روغن هایی استفاده کرد که با داشتن اسید اولئیک و اسید لینولئیک به یک میزان و داشتن آمینو اسیدها یک لایه محافظ رطوبتی روی پوست ایجاد می کنند و از خروج رطوبت از پوست جلوگیری می کنند و پوست را در طول روز مرطوب نگه می دارند.";
			pName1="روغن هسته هلو   ";
			pName2="روغن ترنج  ";
			pImage1="";
			pImage2="";
			pLink1="https://naringol.com/peach-kernel-oil.html";
			pLink2="https://naringol.com/organic-pure-bergamot-oil.html";
			pContent="هر شب در آخرین مرحله روتین دو تا چهار قطره از ترکیب 3 قاشق غذاخوری روغن هسته هلو و ده قطره روغن ترنج را بر پوست تمیز ماساژ دهید. این ترکیب را تنها شب ها استفاده نمایید و روز بعد از ضد آفتاب قوی استفاده کنید. قبل از مصرف این ترکیب آن را از یک روز قبل روی دست خود تست نمایید.";
		}
		document.getElementById("test-result-type-title").innerHTML=rTitle;
		document.getElementById("test-result-type-content").innerHTML=rContent;
		document.getElementById("result-recommend-product1-img").style.backgroundImage="url('"+pImage1+"')";
		document.getElementById("result-recommend-product2-img").style.backgroundImage="url('"+pImage2+"')";
		document.getElementById("result-recommend-product1-title").innerHTML=pName1;
		document.getElementById("result-recommend-product2-title").innerHTML=pName2;
		document.getElementById("result-recommend-product2-link").href=pLink1;
		document.getElementById("result-recommend-product2-link").href=pLink2;
		document.getElementById("result-recommend-content").innerHTML=pContent;
		
	}
}

